/*:
 ## Упражнение 5 - константа или переменная?
 
 Представьте, что вы создаёте простое приложение для обмена фотографиями.  Вы хотите отслеживать показатели для каждого поста:
 
- Number of likes: количество лайков, которое получило фото
- Number of comments: количество комментариев, которое пользователи оставили под фото
- Year created: год, когда была создана заметка
- Month created: месяц, когда была создана заметка, представленный числом от 1 до 12
- Day created: день, когда была создана заметка
 
 Для каждого показателя объявите либо константу, либо переменную, и присвойте значение, соответствующее гипотетической заметке.  Используйте надлежащие имена переменных.
 */
var numbersOfLikes: Int
var numbersOfComments: Int

let yearCreated: Int
let monthCreated: Int
let dayCreated: String



//: [Ранее](@previous)  |  страница 5 из 10  |  [Далее: Упражнение 6 для приложения: константа или переменная?](@next)
