/*:
 ## Упражнение 2 для приложения - Целевое число шагов
 
 >Эти упражнения подкрепляют понятия Swift в контексте фитнес-приложения.

 Вашему фитнес-приложению нужно знать число шагов, которое пользователь наметил пройти за день.  Создайте константу `goalSteps` и установите её равной 10000.
 */
let goalSteps = 10_000
var steps = 1798
/*:
 Используйте две функции `print`, чтобы напечатать две строки в консоль.  Первая строка должна отобразить "Заданное число шагов на день:", а вторая строка должна вывести значение `goalSteps`, используя созданную вами константу.
 */
print("Steps of day: \(steps)")
print(goalSteps)

//: [Ранее](@previous)  |  страница 2 из 10  |  [Далее: Упражнение 3 — переменные](@next)
