/*:
 ## Упражнение - порядок операций

 Напечатайте, чему, по вашему мнению, будет равно 10 + 2 * 5.  Затем напечатайте само выражение (т.е. `print(10 + 2 * 5)`)
 */
//20
print(10+2*5)

/*:
 В новом операторе `print` добавьте необходимые скобки, чтобы сложение произошло перед умножением.
 */
print((10+2)*5)

/*:
 Напечатайте, чему, по вашему мнению, будет равно 4 * 9 - 6 / 2.  Затем напечатайте само выражение.
 */
//33
print(4*9-6/2)

/*:
 В ещё одном операторе `print` добавьте скобки так, чтобы вычитание получило приоритет перед умножением и делением.
 */
print(4*(9-6)/2)

//: [Ранее](@previous)  |  страница 5 из 8  |  [Далее: Упражнение для приложения - сложные фитнес-вычисления](@next)
